* Midnight Commander

** Installation

   1. Review pre-existing configuration.
      The current configuration looks like:

      #+NAME: review-config
	    #+begin_src bash :results output
	      ls -la "${HOME}"/.config/mc | cut -d' ' -f12-
	      tree "${HOME}"/.config/mc
	    #+end_src
	 
	    #+RESULTS:
      : lrwxr-xr-x  1 pgpb.padilla  staff  31 26 Mär 17:41 /Users/pgpb.padilla/.config/mc -> /Users/pgpb.padilla/dotfiles/mc
      : /Users/pgpb.padilla/.config/mc
      : ├── README.org
      : ├── ini
      : └── panels.ini
      : 
      : 0 directories, 3 files

   2. Install the configuration in this repository by
      linking to the current directory:
  
	    #+begin_src bash :results output
        echo "Existing config ..."
        ls -la "${HOME}"/.config/mc | cut -d' ' -f12-
        echo "Removing existing config.."
        rm -rv ~/.config/mc
        echo "Installing new config ..."
        ln -sfv "$(pwd)" "${HOME}"/.config
        echo "Done. Ok."
	    #+end_src
	 
	    #+RESULTS:
      : /Users/pgpb.padilla/.config/mc -> /Users/pgpb.padilla/dotfiles/mc

      As a bonus, any changes you make via MC's UI will be
      automatically saved to this repository.
      
   3. Verify installed configuration by re-running [[review-config]]
